package day002_variable;
/**
 * 这是一个变量的测试类
 *
 */
public class VariableTest {

	public static void main(String[] args) {
		int age;// 声明一个int类型变量age
		age = 2;// 
		//
		System.out.println(age);
		
		age = age + 1;// 将age的值25取出来，然后+1，再重新赋值给变量age
		
		// 3.1 	使用方式3：赋值给另外的变量
		;// 声明另外一个int变量age2
		;// 将age中的值26赋值给age2
		;// 26
		
		/*
		 *  变量也可以声明的时候直接赋值使用
		 *  语法：数据类型 变量名 = 值;
		 *  例如： int age3 = 25;
		 */
		;// 声明一个int类型变量age3，直接赋值为25
		// 直接打印输出age3的值
		;
		
		/*
		 * 变量也可以直接声明多个变量，但是不建议。
		 * 语法：
		 * 		数据类型 变量名1,变量名2,变量名3;
		 * 例如:
		 * 	int a, b, c;
		 */
		;// 声明int类型的3个变量，分别是a/b/c
		// 赋值
		;
		;
		;
		
		
		/*
		 * 变量也可以直接声明多个变量并且同时赋值，但是不建议。
		 * 语法：
		 * 		数据类型 变量名1 = 值1,变量名2 = 值2,变量名3 = 值3;
		 * 例如:
		 * 	int e = 1, f = 2, g = 3;
		 */
		;// 声明int类型的3个变量，分别是e赋值为1，f赋值为2，g赋值为3
		
	}

}
